<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Cap&iacute;tulo 1. Introdu&ccedil;&atilde;o</title><link rel="stylesheet" type="text/css" href="estilo.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="Introdu&ccedil;&atilde;o &agrave; programa&ccedil;&atilde;o em Qt"><link rel="up" href="index.html" title="Introdu&ccedil;&atilde;o &agrave; programa&ccedil;&atilde;o em Qt"><link rel="prev" href="index.html" title="Introdu&ccedil;&atilde;o &agrave; programa&ccedil;&atilde;o em Qt"><link rel="next" href="cha.rudimentos.html" title="Cap&iacute;tulo 2. Rudimentos de cria&ccedil;&atilde;o de interface gr&aacute;fica"><meta xmlns:fo="http://www.w3.org/1999/XSL/Format" http-equiv="Content-Type" content="text/html; charset=utf-8"><script xmlns:fo="http://www.w3.org/1999/XSL/Format" type="text/x-mathjax-config">
    MathJax.Hub.Config({
    extensions: ["tex2jax.js"],
    jax: ["input/TeX","output/HTML-CSS"],
    tex2jax: {inlineMath: [["$","$"],["\\(","\\)"]]}
    });
  </script><script xmlns:fo="http://www.w3.org/1999/XSL/Format" type="text/javascript" src="http://www.dca.ufrn.br/~ambj/mathjax/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Cap&iacute;tulo 1. Introdu&ccedil;&atilde;o</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">Anterior</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="cha.rudimentos.html">Pr&oacute;xima</a></td></tr></table><hr></div><div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="cha.introducao"></a>Cap&iacute;tulo 1. Introdu&ccedil;&atilde;o</h1></div></div></div><div class="toc"><p><b>&Iacute;ndice</b></p><dl class="toc"><dt><span class="sect1"><a href="cha.introducao.html#sec1.introducao.oque%C3%A9">1.1. O que &eacute; o Qt (<span class="foreignphrase"><em class="foreignphrase">software</em></span>)?</a></span></dt><dt><span class="sect1"><a href="cha.introducao.html#sec1.introducao.ambiente">1.2. Preparando o ambiente de trabalho</a></span></dt><dd><dl><dt><span class="sect2"><a href="cha.introducao.html#sec2.introducao.ambiente.qtwindows">1.2.1. Prepara&ccedil;&atilde;o do <span class="application">Qt SDK</span> no Windows</a></span></dt><dt><span class="sect2"><a href="cha.introducao.html#sec2.introducao.ambiente.qtlinux">1.2.2. <span class="application">Qt SDK</span> no Linux</a></span></dt></dl></dd><dt><span class="sect1"><a href="cha.introducao.html#sec1.introducao.primeiro">1.3. Primeiro Programa</a></span></dt><dt><span class="sect1"><a href="cha.introducao.html#sec1.introducao.nossoprojeto">1.4. Nosso projeto</a></span></dt></dl></div>
     
    
    <div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec1.introducao.oque%C3%A9"></a>1.1. O que &eacute; o Qt (<span class="foreignphrase"><em class="foreignphrase">software</em></span>)?</h2></div></div></div>
      
      
      
      <p><span class="application">Qt</span> &eacute; uma biblioteca de programa&ccedil;&atilde;o em C++ cujo principal objetivo &eacute; possibilitar o desenvolvimento de aplica&ccedil;&otilde;es multiplataforma a partir de um mesmo c&oacute;digo fonte. Ela foi concebida em 1991 por <span class="personname">Haavard Nord</span> e <span class="personname">Eirik Chambe-Eng</span> na Trolltech, empresa que era sediada na Noruega.</p>
      <p>As primeiras vers&otilde;es do Qt permitiam o desenvolvimento em sistemas <span class="trademark">Windows</span>&copy; e Linux, e, na &eacute;poca, foi bastante popularizada pelo sistema de gerenciamentos de janelas Kde (<a class="ulink" href="www.kde.org" target="_top">www.kde.org</a>). A evolu&ccedil;&atilde;o do <span class="application">Qt</span> chegou a dispositivos m&oacute;veis com Linux embarcado e symbian, chamando a aten&ccedil;&atilde;o de empresas como a Nokia sobre as possibilidades da ferramenta. Em 2008, a Nokia obteve direitos de neg&oacute;cio sobre o <span class="application">Qt</span>, havendo ent&atilde;o se expandido para suportar diversos outros dispositivos criados por esta empresa. Em 2011, a Nokia desistiu do Qt, repassando a licen&ccedil;a comercial da ferramenta para a Digia (<a class="ulink" href="http://www.digia.com" target="_top">www.digia.com</a>). Em 2012, a Digia complementou os direitos obtendo todo o mercado do <span class="application">Qt Creator</span>, sendo at&eacute; hoje a detentora da marca.</p>
      <p>Junto com a biblioteca Qt, seu SDK comporta diversos aplicativos que auxiliam no desenvolvimento de projetos. Entre estes, destaca-se o Qt Creator, um ambiente de desenvolvimento integrado que possibilita programa&ccedil;&atilde;o em Qt de forma eficiente e agrad&aacute;vel. Com o Qt Creator &eacute; poss&iacute;vel criar programas usando a linguagem de programa&ccedil;&atilde;o C++ em sintonia com elementos de programa&ccedil;&atilde;o visual. Em outras palavras, os programas podem ser desenvolvidos arrastando e soltando componentes gr&aacute;ficos como bot&otilde;es e caixas de texto usando o <span class="foreignphrase"><em class="foreignphrase">mouse</em></span>, aumentando o rendimento e facilitando a tarefa de novos usu&aacute;rios se habituarem com o ambiente de desenvolvimento.</p>
      <p>O <span class="application">Qt Creator</span> vem suportando cada vez mais sistemas operacionais diferentes. Ao tempo de escrita desse documento encontrava-se dispon&iacute;veis suportes para Linux, Windows, OS X, Android, iOS e QNX. Grandes empresas usam <span class="application">Qt</span> para desenvolvimento, destacando-se exemplos famosos como <span class="trademark">VLC</span>&#8482; (<span class="foreignphrase"><em class="foreignphrase">player</em></span> de m&iacute;dia),<span class="trademark">Skype</span>&#8482;,<span class="trademark">Google Earth</span>&#8482;.</p> 
    </div>
    <div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec1.introducao.ambiente"></a>1.2. Preparando o ambiente de trabalho</h2></div></div></div>
      
            
      
      <p>O <span class="application">Qt</span> possui diversas vers&otilde;es dispon&iacute;veis, cada uma adequada a um tipo de ambiente e filosofia de desenvolvimento. Neste tutorial, ser&atilde;o descritos os principais passos para <span class="foreignphrase"><em class="foreignphrase">download</em></span> e instala&ccedil;&atilde;o do <span class="application">Qt</span> nos sistemas operacionais Windows e Linux.</p>
      <p>&Eacute; importante notar que a biblioteca tamb&eacute;m &eacute; disponibilizada para desenvolvimento de aplica&ccedil;&otilde;es comerciais, de sorte que o usu&aacute;rio deve verificar no <span class="foreignphrase"><em class="foreignphrase">website</em></span> da Digia mais detalhes sobre o uso de licen&ccedil;as comerciais. Neste tutorial, o foco ser&aacute; dado &agrave; vers&atilde;o de c&oacute;digo aberto do <span class="application">Qt</span>.</p>
      <p>O <span class="application">Qt SDK</span> &eacute; um <span class="foreignphrase"><em class="foreignphrase">Software Development Kit</em></span> (<acronym class="acronym">SDK</acronym>), ou seja, um conjunto de aplica&ccedil;&otilde;es que permitem a cria&ccedil;&atilde;o de programas de computador usando Qt. No <acronym class="acronym">SDK</acronym> s&atilde;o inclu&iacute;dos a biblioteca Qt, o ambiente de desenvolvimento integrado Qt Creator, al&eacute;m de outros aplicativos que operam em conjunto para permitir a gera&ccedil;&atilde;o e compila&ccedil;&atilde;o de c&oacute;digo fonte em C++ com esta biblioteca.</p>
      <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><table border="0" summary="Warning"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Aten&ccedil;&atilde;o]" src="images/warning.png"></td><th align="left">Aten&ccedil;&atilde;o</th></tr><tr><td align="left" valign="top"><p>O Qt por si s&oacute; n&atilde;o &eacute; um compilador, tratando-se apenas de uma biblioteca de programa&ccedil;&atilde;o. O compilador deve coexistir na m&aacute;quina para que se possam produzir c&oacute;digos execut&aacute;veis usando Qt.</p></td></tr></table></div>
      <div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="sec2.introducao.ambiente.qtwindows"></a>1.2.1. Prepara&ccedil;&atilde;o do <span class="application">Qt SDK</span> no Windows</h3></div></div></div>
	
	<p>Acessando o site do <span class="orgname">Qt-Project</span> (<a class="ulink" href="http://qt-project.org/" target="_top">http://qt-project.org/</a>), &eacute; poss&iacute;vel chegar &agrave; &aacute;rea de <span class="foreignphrase"><em class="foreignphrase">downloads</em></span> e escolher o instalador mais adequado para cada caso. &Eacute; importante lembrar que as vers&otilde;es de instaladores <span class="foreignphrase"><em class="foreignphrase">online</em></span> s&atilde;o menores, por&eacute;m necessitam de conex&atilde;o com a Internet durante a instala&ccedil;&atilde;o. As vers&otilde;es completas s&atilde;o maiores, por&eacute;m n&atilde;o necessitam de conex&atilde;o com a internet.</p>
	<p>Os exemplos expostos neste texto ser&atilde;o apresentados com base na instala&ccedil;&atilde;o do <span class="application">Qt SDK</span> no <span class="trademark">Windows</span>&reg; com a vers&atilde;o completa, posto que prov&ecirc; toda a parafernalha necess&aacute;ria para o programador. A instala&ccedil;&atilde;o em vers&atilde;o online &eacute; bastante similar, de modo que os passos ilustrados a seguir ser&atilde;o &uacute;teis para ambas as instala&ccedil;&otilde;es.</p>
	<p>Podem ser encontradas diversas vers&otilde;es do instalador do Qt para <span class="trademark">Windows</span>&reg;. As vers&otilde;es geralmente contemplam o compilador utilizado e a arquitetura do sistema operacional. Duas categorias de vers&otilde;es s&atilde;o as mais comuns: aquelas que usam o compilador Visual Studio e as que usam o compilador MinGW. Caso o usu&aacute;rio disponha do Visual Studio, este dever&aacute; escolher a que melhor se adapta ao seus sistema. Caso n&atilde;o possua o compilador, melhor escolher a vers&atilde;o que vem com o MinGW inclu&iacute;do. Caso o usu&aacute;rio disponha dos compiladores nativos da <span class="trademark">Microsoft</span>&#8482; deve preferir o uso das vers&otilde;es para o Visual Studio, uma vez que o suporte para diversos recursos do sistema (ex: bibliotecas de reprodu&ccedil;&atilde;o de arquivos multim&iacute;dia) somente est&aacute; dispon&iacute;vel para tais compiladores.</p>
	<p>Ap&oacute;s ter carregado e executado devidamente o instalador &eacute; iniciado o processo de instala&ccedil;&atilde;o, a seguinte tela surgir&aacute;:</p>
	
	<div class="figure"><a name="fig.introducao.ambiente.qtwindows.instalacaoWelcome"></a><p class="title"><b>Figura 1.1. Tela de boas-vindas do instalador</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/instalacao_welcome.svg">figuras/capitulo1/instalacao_welcome.svg</object></div></div>
	</div></div><br class="figure-break">
	<p>Clique em <span class="keycap"><strong>Next</strong></span> para prosseguir a instala&ccedil;&atilde;o. Em seguida &eacute; requisitado o local de instala&ccedil;&atilde;o do <span class="application">Qt SDK</span>, por padr&atilde;o o instalador ir&aacute; coloc&aacute;-lo no disco <code class="filename">C:</code> por&eacute;m isto pode ser alterado clicando em <span class="keycap"><strong>Browse...</strong></span>. O <span class="foreignphrase"><em class="foreignphrase">checkbox</em></span> na parte inferior da janela seleciona se o <span class="application">Qt Creator</span> dever&aacute; reconhecer arquivos do tipo <code class="filename">.c,.h,.cc,.hh,.cxx,.hxx,.c++,.h++, .cpp</code> e <code class="filename">.hpp</code> como arquivo padr&atilde;o de execu&ccedil;&atilde;o.</p> 
	
	<div class="figure"><a name="fig.introducao.ambiente.qtwindows.instalacaoDiretorio"></a><p class="title"><b>Figura 1.2. Definindo diret&oacute;rio do Qt Creator</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/instalacao_diretorio.svg">figuras/capitulo1/instalacao_diretorio.svg</object></div></div>
	</div></div><br class="figure-break">
	<p>Clique em <span class="keycap"><strong>Next</strong></span> para prosseguir a instala&ccedil;&atilde;o. Na janela seguinte ser&aacute; solicitado os componentes que se deseja instalar, por padr&atilde;o o instalador ir&aacute; instalar somente o <span class="application">Qt SDK</span> e a ferramenta de compila&ccedil;&atilde;o, no caso em exemplo ser&aacute; o <span class="application">MinGW</span> <span class="productnumber">4.8</span>, para se usar o <span class="application">Visual Studio</span> como compilador deve-se carregar o instalador com VS na p&aacute;gina de downloads do <span class="orgname">Qt-Project</span>. Essas defini&ccedil;&otilde;es padr&otilde;es s&atilde;o as b&aacute;sicas para a execu&ccedil;&atilde;o do <span class="application">Qt Creator</span> por&eacute;m aconselha-se a selecionar todos os componentes para evitar problemas futuros. Sendo assim, clique em <span class="keycap"><strong>Default</strong></span> para selecionar o componentes padr&otilde;es, <span class="keycap"><strong>Select All</strong></span> para selecionar todos os componentes e <span class="keycap"><strong>Deselect All</strong></span> para selecionar nenhuma componente. &Eacute; poss&iacute;vel a todo momento visualizar no lado direito da janela o quanto ser&aacute; instalado no computador de acordo com a sele&ccedil;&atilde;o dos componentes.</p>
	
	<div class="figure"><a name="fig.introducao.ambiente.qtwindows.instalacaoComponentes"></a><p class="title"><b>Figura 1.3. Sele&ccedil;&atilde;o dos componentes para instala&ccedil;&atilde;o</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/instalacao_componentes.svg">figuras/capitulo1/instalacao_componentes.svg</object></div></div>
	</div></div><br class="figure-break">
	<p>Clique em <span class="keycap"><strong>Next</strong></span> para prosseguir a instala&ccedil;&atilde;o. Prosseguindo, o instalador ir&aacute; se certificar se o usu&aacute;rio est&aacute; de acordo com as licen&ccedil;as LGPL, FDL, GPL e exce&ccedil;&otilde;es de LGPL que s&atilde;o em suma permiss&otilde;es, direitos e termos legais de uso do <span class="application">Qt SDK</span> por parte do usu&aacute;rio. Caso o usu&aacute;rio esteja de acordo com as licen&ccedil;as dever&aacute; selecionar a primeira op&ccedil;&atilde;o, caso contr&aacute;rio a &uacute;nica possibilidade ser&aacute; de finalizar a instala&ccedil;&atilde;o.</p>
	
	<div class="figure"><a name="fig.introducao.ambiente.qtwindows.instalacaoAcordo"></a><p class="title"><b>Figura 1.4. Confirma&ccedil;&atilde;o de conhecimento das licen&ccedil;as</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/instalacao_acordo.svg">figuras/capitulo1/instalacao_acordo.svg</object></div></div>
	</div></div><br class="figure-break">
	<p>Clique em <span class="keycap"><strong>Next</strong></span> para prosseguir a instala&ccedil;&atilde;o. Feito isso, o instalador ir&aacute; requisitar o apelido que ser&aacute; dado ao <span class="application">Qt SDK</span>, por padr&atilde;o o apelido ser&aacute; <span class="type">Qt &lt;vers&atilde;o&gt;</span> sendo pass&iacute;vel de altera&ccedil;&atilde;o pelo usu&aacute;rio. Clique em <span class="keycap"><strong>Next</strong></span> para prosseguir a instala&ccedil;&atilde;o. Ap&oacute;s ter configurado todos os dados, o instalador ir&aacute; fornecer um resumo do que e como ser&aacute; instalado de forma que o usu&aacute;rio esteja ciente das informa&ccedil;&otilde;es fornecidas, clique em <span class="keycap"><strong>Show Details</strong></span> para ver detalhes da instala&ccedil;&atilde;o. Clique em <span class="keycap"><strong>Install</strong></span> para iniciar a instala&ccedil;&atilde;o.</p>
	
	<div class="figure"><a name="fig.introducao.ambiente.qtwindows.instalacaoResumo"></a><p class="title"><b>Figura 1.5. Resumo do que ser&aacute; instalado</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/instalacao_resumo.svg">figuras/capitulo1/instalacao_resumo.svg</object></div></div>
	</div></div><br class="figure-break">
	
	<div class="figure"><a name="fig.introducao.ambiente.qtwindows.instalacaoCarregando"></a><p class="title"><b>Figura 1.6. Instala&ccedil;&atilde;o sendo executada</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/instalacao_carregando.svg">figuras/capitulo1/instalacao_carregando.svg</object></div></div>
	</div></div><br class="figure-break">
	<p>Durante a instala&ccedil;&atilde;o &eacute; poss&iacute;vel ver o que est&aacute; sendo feito clicando em <span class="keycap"><strong>Show Details</strong></span>, aguarde a instala&ccedil;&atilde;o ser finalizada, isso poder&aacute; levar alguns minutos. Ao fim da instala&ccedil;&atilde;o clique em <span class="keycap"><strong>Next</strong></span>, o instalador chegar&aacute; a sua &uacute;ltima parte onde o usu&aacute;rio dever&aacute; selecionar se deseja executar o <span class="application">Qt Creator</span> ao finalizar a instala&ccedil;&atilde;o e se deseja abrir o arquivo <code class="filename">ReadMe</code> do <span class="application">Qt Creator</span> ao fim da instala&ccedil;&atilde;o, este arquivo cont&eacute;m informa&ccedil;&otilde;es b&aacute;sicas sobre a vers&atilde;o do <span class="application">Qt Creator</span> e sites para mais informa&ccedil;&otilde;es. O usu&aacute;rio dever&aacute; selecionar o que deseja e clicar em <span class="keycap"><strong>Finish</strong></span>. Desta forma o <span class="application">Qt SDK</span> estar&aacute; instalado no seu computador.</p> 
      </div>
      <div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="sec2.introducao.ambiente.qtlinux"></a>1.2.2. <span class="application">Qt SDK</span> no Linux</h3></div></div></div>
	
	
	<p>&Eacute; poss&iacute;vel instalar o <span class="application">Qt SDK</span> no Linux digitando apenas uma linha de c&oacute;digo. Abra o terminal e digite o seguinte comando:</p>
	<pre class="screen"><span class="command"><strong>sudo apt-get install ubuntu-sdk</strong></span></pre>
	<p>O sistema ir&aacute; executar o comando e confirmar se o usu&aacute;rio deseja instalar o pacote. Confirme a instala&ccedil;&atilde;o e aguarde o processo.</p>
	
	<p>Feita a instala&ccedil;&atilde;o basta executar o comando <span class="command"><strong>qtcreator</strong></span> no terminal e ent&atilde;o o <acronym class="acronym">SDK</acronym> ser&aacute; executado.</p>
      </div>
    </div>
    <div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec1.introducao.primeiro"></a>1.3. Primeiro Programa</h2></div></div></div>
      
      
      <p>Com o <span class="application">Qt SDK</span> instalado podemos executar nosso primeiro programa. Seja em qual for o <acronym class="acronym">SO</acronym> (Windows ou Linux) a forma de programa&ccedil;&atilde;o &eacute; a mesma. &Eacute; aconselh&aacute;vel a se criar uma pasta para armazenar os programas criados a partir deste tutorial com o objetivo de facilitar o desenvolvimento do leitor e evitar poss&iacute;veis erros de compila&ccedil;&atilde;o.</p>
      <p>Abra o <span class="application">Qt Creator</span>, a tela de boas-vindas ser&aacute; exibida. Clique em <code class="option">Arquivo</code> e selecione a op&ccedil;&atilde;o <code class="option">Novo Arquivo ou Projeto</code>, em seguida surgir&aacute; uma janela onde ser&aacute; poss&iacute;vel seleciona qual tipo de arquivo ou projeto ser&aacute; iniciado.</p>
      
	<div class="figure"><a name="fig.introducao.primeiro.primeiroSelecao"></a><p class="title"><b>Figura 1.7. Escolha por qual tipo de projeto ou arquivo</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/primeiro_selecao.svg">figuras/capitulo1/primeiro_selecao.svg</object></div></div>
	</div></div><br class="figure-break">
      <p>Selecione por <code class="option">Application</code>, em seguida <code class="option">Qt Gui Application</code> e ent&atilde;o clique em <span class="keycap"><strong>Choose...</strong></span>. O <code class="option">Qt Gui Application</code> permite que sejam criados programas com interface gr&aacute;fica. Ap&oacute;s clicado no bot&atilde;o <span class="keycap"><strong>Choose...</strong></span> ser&aacute; solicitado o nome e o local do projeto, digite o nome e escolha o local de cria&ccedil;&atilde;o do programa. O checkbox na parte inferior da janela quando habilitado faz com que o local de cria&ccedil;&atilde;o dos restantes dos programas criados pelo <span class="application">Qt Creator</span> sejam pr&eacute;-definidos no diret&oacute;rio definido anteriormente. Feito o preenchimento do nome e diret&oacute;rio do programa clique em <span class="keycap"><strong>Next&gt;</strong></span> para prosseguir na instala&ccedil;&atilde;o.</p>
      
	<div class="figure"><a name="fig.introducao.primeiro.primeiroDiretorio"></a><p class="title"><b>Figura 1.8. Definindo nome e diret&oacute;rio do projeto</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/primeiro_diretorio.svg">figuras/capitulo1/primeiro_diretorio.svg</object></div></div>
	</div></div><br class="figure-break">
      <p>Na janela seguinte o <span class="application">Qt Creator</span> solicitar&aacute; o local de cria&ccedil;&atilde;o das vers&otilde;es depura&ccedil;&atilde;o e de lan&ccedil;amento do programa. Isto possibilita separar o c&oacute;digo fonte do programa dos c&oacute;digos de compila&ccedil;&atilde;o gerados automaticamente e o execut&aacute;vel que ser&atilde;o salvos em outras pastas. Por padr&atilde;o habilite o programa para criar locais de depura&ccedil;&atilde;o e lan&ccedil;amento e clique em <span class="keycap"><strong>Next&gt;</strong></span>.</p>
      
	<div class="figure"><a name="fig.introducao.primeiro.primeiroDepuracao"></a><p class="title"><b>Figura 1.9. Criando diret&oacute;rios de depura&ccedil;&atilde;o e lan&ccedil;amento</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/primeiro_depuracao.svg">figuras/capitulo1/primeiro_depuracao.svg</object></div></div>
	</div></div><br class="figure-break">
      <p>Em sequ&ecirc;ncia o <span class="application">Qt Creator</span> solicitar&aacute; informa&ccedil;&otilde;es sobre a classe que ser&aacute; criada, o tipo de classe que se deseja criar (<code class="classname">QMainWindow</code>, <code class="classname">QWidget</code> ou <code class="classname">QDialog</code>) o nome do arquivo <code class="filename">header</code> (.h), <code class="filename">fonte</code> (.cpp) e em caso de habilitado o nome do arquivo de <code class="filename">form</code> (.ui). Para in&iacute;cio desejamos criar uma janela simples ent&atilde;o deixamos tudo como padr&atilde;o e no futuro estas op&ccedil;&otilde;es ser&atilde;o melhor explanadas. Clique em <span class="keycap"><strong>Next&gt;</strong></span> para prosseguir na cria&ccedil;&atilde;o do programa. </p>
      
	<div class="figure"><a name="fig.introducao.primeiro.primeiroClasses"></a><p class="title"><b>Figura 1.10. Definindo o nome da classe e dos arquivos</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/primeiro_classes.svg">figuras/capitulo1/primeiro_classes.svg</object></div></div>
	</div></div><br class="figure-break">
      <p>Por fim ser&aacute; exibida uma &uacute;ltima janela de resumo, confirmando todos os passos anteriormente feito. Percebe-se que o <span class="application">Qt Creator</span> confirma o diret&oacute;rio no qual ser&aacute; criado o programa e os arquivos nele criado. Caso esteja de acordo com os dados obtidos clique em <span class="keycap"><strong>Finish</strong></span>. O <span class="application">Qt Creator</span> ent&atilde;o iniciar&aacute; a cria&ccedil;&atilde;o dos arquivos e ir&aacute; exibi-los em uma &aacute;rvore de diret&oacute;rios.</p>
      
	<div class="figure"><a name="fig.introducao.primeiro.primeiroResumo"></a><p class="title"><b>Figura 1.11. Informa&ccedil;&otilde;es finais da cria&ccedil;&atilde;o do projeto</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/primeiro_resumo.svg">figuras/capitulo1/primeiro_resumo.svg</object></div></div>
	</div></div><br class="figure-break">
      
	<div class="figure"><a name="fig.introducao.primeiro.primeiroJanelaInicial"></a><p class="title"><b>Figura 1.12. Projeto criado e apto ao desenvolvimento</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/primeiro_janelainicial.svg">figuras/capitulo1/primeiro_janelainicial.svg</object></div></div>
	</div></div><br class="figure-break">
      <p>Estando com o programa criado, &eacute; poss&iacute;vel acessar a todos os arquivos sejam eles:<code class="filename"> headers</code> (.h), <code class="filename">fontes</code> (.cpp),<code class="filename">forms</code> (.ui) e arquivo de extens&atilde;o <code class="filename">pro</code>. D&ecirc; dois cliques no arquivo de <code class="filename">form</code> (.ui), ser&aacute; exibida a janela do programa em constru&ccedil;&atilde;o. Clique em <code class="option">Filter</code> e digite <span class="type">Label</span>, no visor logo abaixo estar&aacute; o <code class="classname">widget Label</code>, clique e arraste at&eacute; a janela central.</p>
      
	<div class="figure"><a name="fig.introducao.primeiro.primeiroLabel"></a><p class="title"><b>Figura 1.13. Posicionando o widget Label na janela</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/primeiro_label.svg">figuras/capitulo1/primeiro_label.svg</object></div></div>
	</div></div><br class="figure-break">
      <p>De forma similar digite em <code class="option">Filter</code> por <span class="type">Push Button</span> e arraste-o para a janela. A partir deste ponto o programa pode ser executado clicando em <span class="command"><strong>Run</strong></span>, o <span class="application">Qt Creator</span> solicitar&aacute; por salvar as altera&ccedil;&otilde;es e ent&atilde;o construir&aacute; o programa. Durante a execu&ccedil;&atilde;o nada ocorrer&aacute; pois n&atilde;o h&aacute; nenhuma l&oacute;gica ou evento implementado.</p>
      
	<div class="figure"><a name="fig.introducao.primeiro.primeiroPushbutton"></a><p class="title"><b>Figura 1.14. Posicionando o widget Pushbutton na janela</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/primeiro_pushbutton.svg">figuras/capitulo1/primeiro_pushbutton.svg</object></div></div>
	</div></div><br class="figure-break">
      
	<div class="figure"><a name="fig.introducao.primeiro.primeiroExecucao"></a><p class="title"><b>Figura 1.15. Primeiro programa sendo executado</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/primeiro_execucao.svg">figuras/capitulo1/primeiro_execucao.svg</object></div></div>
	</div></div><br class="figure-break">
      <p>Feche o programa e clique com o bot&atilde;o direito sobre o <code class="classname">Push Button</code> que est&aacute; na janela principal, selecione <code class="option">Go To Slot...</code>, na nova janela clique na op&ccedil;&atilde;o <code class="option">Clicked()</code> e ent&atilde;o em <span class="keycap"><strong>OK</strong></span>. O <span class="application">Qt Creator</span> ir&aacute; implementar automaticamente uma fun&ccedil;&atilde;o na classe do projeto referente ao evento de clique do bot&atilde;o. Dentro da fun&ccedil;&atilde;o copie o seguinte c&oacute;digo e clique em <span class="command"><strong>Run</strong></span> novamente.</p>
      <pre class="screen"><span class="command"><strong> ui-&gt;label-&gt;setText("Hello!");</strong></span></pre>
      <p>Desta vez o programa possui uma a&ccedil;&atilde;o para o evento do clique no bot&atilde;o.</p>
      
	<div class="figure"><a name="fig.introducao.primeiro.primeiroLogica"></a><p class="title"><b>Figura 1.16. Primeiro programa sens&iacute;vel ao evento sendo executado</b></p><div class="figure-contents">
	  
	  <div class="mediaobject"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figuras/capitulo1/primeiro_logica.svg">figuras/capitulo1/primeiro_logica.svg</object></div></div>
	</div></div><br class="figure-break">
      <p>Este foi um programa simples, por&eacute;m o <span class="application">Qt Creator</span> tem mais fun&ccedil;&otilde;es para cada <code class="classname">widget</code> e muitas bibliotecas com in&uacute;meras funcionalidades, em geral o <span class="application">Qt Creator</span> possibilita a cria&ccedil;&atilde;o de programas bons e eficientes de forma muito pr&aacute;tica.</p>
    </div>
    <div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec1.introducao.nossoprojeto"></a>1.4. Nosso projeto</h2></div></div></div>
      
      <p>Agora que j&aacute; sabemos como instalar o <span class="application">Qt Creator</span> e como construir um programa podemos definir uma ideia final de projeto.</p>
      <p>Este tutorial ter&aacute; por objetivo ensinar e demonstrar a implementa&ccedil;&atilde;o de ferramentas do <span class="application">Qt Creator</span> com base na constru&ccedil;&atilde;o de um projeto final, desta forma ao fim deste tutorial teremos um <span class="foreignphrase"><em class="foreignphrase">software</em></span>. Este <span class="foreignphrase"><em class="foreignphrase">software</em></span> ser&aacute; um <span class="foreignphrase"><em class="foreignphrase">Media Player</em></span> capaz de reproduzir arquivos de &aacute;udio, exibir lista de m&uacute;sicas, imagens de capa de <acronym class="acronym">CD</acronym> obtidas da internet, visualizador de espectro e etc.</p>
      <p>Com todo o conhecimento obtido neste tutorial ser&aacute; poss&iacute;vel fazer um <span class="foreignphrase"><em class="foreignphrase">Media Player</em></span> e ainda pass&iacute;vel de explora&ccedil;&otilde;es pois o leitor estar&aacute; apto a gerar solu&ccedil;&otilde;es de forma independente. Nos pr&oacute;ximos cap&iacute;tulos ser&atilde;o demonstrados as caracter&iacute;sticas b&aacute;sicas de cria&ccedil;&atilde;o de interfaces gr&aacute;ficas.</p>
    </div>  
  </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">Anterior</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="cha.rudimentos.html">Pr&oacute;xima</a></td></tr><tr><td width="40%" align="left" valign="top">Introdu&ccedil;&atilde;o &agrave; programa&ccedil;&atilde;o em Qt&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Principal</a></td><td width="40%" align="right" valign="top">&nbsp;Cap&iacute;tulo 2. Rudimentos de cria&ccedil;&atilde;o de interface gr&aacute;fica</td></tr></table></div><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navheader"><hr><table width="100%"><tr><td align="center"><p class="copyright">Copyright &copy; 2014 Tiago Fernandes</p></td></tr></table></div></body></html>